app/controllers/artists_controller.rb

SELECT  "preferences".* FROM "preferences"  ORDER BY "preferences"."id" ASC LIMIT 1
SELECT "artists".* FROM "artists"
SELECT "artists".* FROM "artists"  ORDER BY "artists"."name" DESC
---
  def index
    pref = Preference.first_or_create(artist_sort_order: "DESC")
    pref.artist_sort_order = "DESC" if pref.artist_sort_order.blank?
    @artists = Artist.all.order(name: pref.artist_sort_order)

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
---
  def show
    @artist = Artist.find(params[:id])

SELECT  "preferences".* FROM "preferences"  ORDER BY "preferences"."id" ASC LIMIT 1
---
  def new
    pref = Preference.first