app/controllers/songs_controller.rb

SELECT  "preferences".* FROM "preferences"  ORDER BY "preferences"."id" ASC LIMIT 1
SELECT "songs".* FROM "songs"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"  ORDER BY "songs"."title" ASC
---
  def index
    pref = Preference.first_or_create(song_sort_order: "DESC")
    pref.song_sort_order = "DESC" if pref.song_sort_order.blank?
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      if @artist.nil?
        redirect_to artists_path, alert: "Artist not found"
      else
        @songs = @artist.songs.order(title: pref.song_sort_order)